{
	"intents": [
		{
			"tag": "greeting",
			"patterns": ["Hi", "Hello", "Good morning", "Good afternoon"],
			"responses": [
				"Hello! How can I help you today?",
				"Hi there! What can I do for you?"
			]
		},
		{
			"tag": "farewell",
			"patterns": ["Bye", "See you later", "Goodbye"],
			"responses": ["Goodbye! Have a great day!", "See you later!"]
		},
		{
			"tag": "overview",
			"patterns": ["Tell me about MIIT", "What is MIIT?", "Overview of MIIT"],
			"responses": [
				"MIIT is the Myanmar Institute of Information Technology, a not-for-profit institution established through a collaboration between the governments of India and Myanmar. It offers undergraduate and postgraduate programs in technology and engineering."
			]
		},
		{
			"tag": "mission_vision",
			"patterns": [
				"What is the mission of MIIT?",
				"What is the vision of MIIT?"
			],
			"responses": [
				"MIIT's mission is to produce high-quality graduates equipped with the knowledge and skills necessary to thrive in the information technology industry. Its vision is to become a leading institution for technological education and research in Myanmar."
			]
		},
		{
			"tag": "programs_offered",
			"patterns": [
				"What programs are offered at MIIT?",
				"Tell me about the courses at MIIT"
			],
			"responses": [
				"MIIT offers the following programs:\n- B.E. (Hons.) in Computer Science & Engineering\n- B.E. (Hons.) in Electronics & Communication Engineering\n- Postgraduate Diploma in Software Development"
			]
		},
		{
			"tag": "admission_process",
			"patterns": [
				"How can I get admitted to MIIT?",
				"Tell me about the admission process"
			],
			"responses": [
				"To get admitted to MIIT, applicants must appear for an entrance examination. A weighted average of the performance in the matriculation examination and the entrance examination is used to create a merit list, which is used for final admissions."
			]
		},
		{
			"tag": "tuition_fees",
			"patterns": [
				"What are the tuition fees at MIIT?",
				"Tell me about the fees"
			],
			"responses": [
				"For detailed information about tuition fees, please visit the MIIT official website or contact the admissions office directly."
			]
		},
		{
			"tag": "scholarships",
			"patterns": [
				"Are there any scholarships available?",
				"Tell me about scholarships at MIIT"
			],
			"responses": [
				"MIIT offers various scholarships and financial aid options for eligible students. For more information, please visit the MIIT scholarships page or contact the financial aid office."
			]
		},
		{
			"tag": "campus_facilities",
			"patterns": [
				"What facilities are available on campus?",
				"Tell me about the campus facilities"
			],
			"responses": [
				"MIIT offers a range of facilities including state-of-the-art laboratories, modern classrooms, a well-equipped library, sports facilities, and comfortable student accommodations."
			]
		},
		{
			"tag": "hostel",
			"patterns": [
				"Is hostel accommodation available?",
				"Tell me about the hostels at MIIT"
			],
			"responses": [
				"Yes, MIIT provides hostel accommodation for its students. The hostels are equipped with necessary amenities to ensure a comfortable living environment."
			]
		},
		{
			"tag": "events",
			"patterns": ["What events are held at MIIT?", "Tell me about the events"],
			"responses": [
				"MIIT hosts a variety of events throughout the year including technical seminars, workshops, cultural events, and sports competitions."
			]
		},
		{
			"tag": "location",
			"patterns": [
				"Where is MIIT located?",
				"Tell me about the location of MIIT"
			],
			"responses": [
				"MIIT is located in 73rd Street, Ngu Shwe Wah St, Mandalay, Myanmar. For more details, please visit the contact page on the MIIT website."
			]
		},
		{
			"tag": "contact_information",
			"patterns": [
				"How can I contact MIIT?",
				"Give me the contact details for MIIT"
			],
			"responses": [
				"You can contact MIIT through the following ways:\nPhone: +95-2-123456\nEmail: info@miit.edu.mm\nAddress: Mandalay, Myanmar"
			]
		},
		{
			"tag": "library",
			"patterns": [
				"Tell me about the library",
				"What resources are available in the library?"
			],
			"responses": [
				"The MIIT library offers a wide range of resources including books, journals, research papers, and digital materials to support the academic needs of students and faculty."
			]
		},
		{
			"tag": "faculty",
			"patterns": [
				"Who are the faculty members?",
				"Tell me about the faculty at MIIT"
			],
			"responses": [
				"MIIT has a dedicated team of experienced faculty members who are experts in their respective fields. For detailed profiles, please visit the faculty section on the MIIT website."
			]
		},
		{
			"tag": "career_services",
			"patterns": [
				"Does MIIT offer career services?",
				"Tell me about the career services at MIIT"
			],
			"responses": [
				"MIIT provides comprehensive career services including internship opportunities, career counseling, job placements, and workshops to help students prepare for their professional careers."
			]
		},
		{
			"tag": "student_life",
			"patterns": [
				"What is student life like at MIIT?",
				"Tell me about student life"
			],
			"responses": [
				"Student life at MIIT is vibrant and diverse. Students can participate in various clubs, organizations, and events that cater to a wide range of interests and hobbies."
			]
		},
		{
			"tag": "health_services",
			"patterns": [
				"Are health services available at MIIT?",
				"Tell me about the health services"
			],
			"responses": [
				"Yes, MIIT provides health services to ensure the well-being of its students. This includes access to medical facilities and mental health support."
			]
		},
		{
			"tag": "transportation",
			"patterns": [
				"What transportation options are available?",
				"Tell me about transportation to MIIT"
			],
			"responses": [
				"MIIT is accessible via various transportation options including public transport and private vehicles. Shuttle services are also available for students."
			]
		},
		{
			"tag": "alumni",
			"patterns": [
				"Tell me about MIIT alumni",
				"What do MIIT alumni do?",
				"What are the career paths of MIIT alumni?"
			],
			"responses": [
				"MIIT alumni have gone on to achieve success in various fields including technology, engineering, and research. The alumni network provides opportunities for networking and professional growth."
			]
		},
		{
			"tag": "recent_news",
			"patterns": [
				"What is the latest news about MIIT?",
				"Any recent updates about MIIT?"
			],
			"responses": [
				"For the latest news and updates about MIIT, please visit the news section on the MIIT website or follow their social media channels."
			]
		},
		{
			"tag": "administration",
			"patterns": [
				"Who are the key administrators at MIIT?",
				"Tell me about the administration at MIIT"
			],
			"responses": [
				"The main administrators of MIIT are the Director, the Rector, the Pro-Rector, and the Registrar. They are responsible for implementing the goals of MIIT and ensuring the academic and operational excellence of the institute."
			]
		},
		{
			"tag": "collaborations",
			"patterns": [
				"Which institutions does MIIT collaborate with?",
				"Tell me about MIIT's collaborations"
			],
			"responses": [
				"MIIT collaborates with various international institutions and organizations to enhance its academic programs and research capabilities. These collaborations include partnerships with universities, research centers, and industry leaders."
			]
		},
		{
			"tag": "rankings",
			"patterns": ["How is MIIT ranked?", "Tell me about MIIT's rankings"],
			"responses": [
				"MIIT is recognized as a leading institution for technological education and research in Myanmar. For detailed rankings and achievements, please visit the MIIT website."
			]
		},
		{
			"tag": "research",
			"patterns": [
				"What research opportunities are available at MIIT?",
				"Tell me about research at MIIT"
			],
			"responses": [
				"MIIT offers various research opportunities for students and faculty in fields such as computer science, electronics, and communication engineering. The institute also participates in collaborative research projects with international partners."
			]
		},
		{
			"tag": "extracurricular",
			"patterns": [
				"What extracurricular activities are available at MIIT?",
				"Tell me about extracurriculars at MIIT"
			],
			"responses": [
				"MIIT offers a wide range of extracurricular activities including clubs, sports, cultural events, and community service programs. These activities help students develop their skills and interests outside of academics."
			]
		},
		{
			"tag": "food",
			"patterns": [
				"What dining options are available at MIIT?",
				"Tell me about the food at MIIT"
			],
			"responses": [
				"MIIT provides various dining options for students, including a cafeteria and food stalls that offer a variety of meals and snacks."
			]
		},

		{
            "tag": "internships",
            "patterns": [
                "Are internships available?",
                "Tell me about internship opportunities at MIIT",
                "How can I apply for internships?"
            ],
            "responses": [
                "MIIT offers a variety of internship opportunities in collaboration with industry partners. For more information, please visit the internships section on our website."
            ]
        },
        {
            "tag": "industry_partnerships",
            "patterns": [
                "Who are MIIT's industry partners?",
                "Tell me about industry partnerships",
                "Does MIIT collaborate with companies?"
            ],
            "responses": [
                "MIIT has partnerships with several leading companies in the technology sector, providing students with opportunities for internships, projects, and job placements."
            ]
        },
        {
            "tag": "student_exchange",
            "patterns": [
                "Does MIIT offer student exchange programs?",
                "Tell me about student exchange opportunities",
                "Can MIIT students study abroad?"
            ],
            "responses": [
                "MIIT offers student exchange programs with various international universities. These programs allow students to gain global exposure and experience."
            ]
        },
        {
            "tag": "labs",
            "patterns": [
                "What labs are available at MIIT?",
                "Tell me about the laboratory facilities",
                "Does MIIT have research labs?"
            ],
            "responses": [
                "MIIT is equipped with state-of-the-art laboratories for various disciplines, including computer science, electronics, and communication engineering."
            ]
        },
        {
            "tag": "research_centers",
            "patterns": [
                "What research centers does MIIT have?",
                "Tell me about the research centers at MIIT",
                "Are there any specialized research centers?"
            ],
            "responses": [
                "MIIT hosts several research centers focusing on areas such as artificial intelligence, robotics, and data science. These centers facilitate cutting-edge research and innovation."
            ]
        },
        {
            "tag": "online_learning",
            "patterns": [
                "Does MIIT offer online courses?",
                "Tell me about online learning at MIIT",
                "Can I study online at MIIT?"
            ],
            "responses": [
                "MIIT offers a range of online courses and learning resources, allowing students to study remotely. For more information, please visit the online learning section on our website."
            ]
        },
		{
            "tag": "current_rector",
            "patterns": [
                "Who is the current rector of MIIT?",
                "Tell me about the rector of MIIT",
                "Who is leading MIIT?",
                "Who is the head of MIIT?"
            ],
            "responses": [
                "The current rector of MIIT is Dr.Win Aye.Dr. Win Aye has a doctorate from Multimedia University, Malaysia and is the Rector of MIIT. She received her B.C.Tech. (Bachelor of Computer Technology) and M.C.Tech. (Master of Computer Technology) degrees from the University of Computer Studies, Yangon (UCSY) in 1995 and 1999 respectively."
            ]
        },
		{
            "tag": "pro_rector",
            "patterns": [
                "Who are the current pro-rectors of MIIT?",
                "Tell me about the pro-rector of MIIT?"
            ],
            "responses": [
                "Dr. Myat Thuzar Tun and Dr. Khaing Nyunt Myaing are the pro-rectors of MIIT. Dr. Myat Thuzar Tun takes responsibility for administration of all activities related to academics. Dr. Khaing Nyunt Myaing takes the responsibility of the administration of Academic and non-academic work of the Institute."
            ]
        },
		{
   			 "tag": "history_of_miit",
   			 "patterns": [
      		  "Tell me the history of MIIT",
       		 "What is the history of MIIT?",
       		 "How was MIIT established?",
        		"Give me the background of MIIT"
    		],
    		"responses": [
        	"MIIT, the Myanmar Institute of Information Technology, was established in December 2015 through a collaboration between the governments of India and Myanmar. It aims to provide high-quality education and research in the field of information technology. For more information, you can visit the history section on the MIIT website."
    		]
		},
		{
    "tag": "project_show",
    "patterns": [
        "Tell me about the Project Show at MIIT",
        "What is the Project Show and Competition?",
        "Details about MIIT Project Show",
        "What happens at the MIIT Project Show?"
    ],
    "responses": [
        "The Project Show and Competition at MIIT is an annual event where faculty members and students showcase their skills, creativity, and innovative ideas through various projects. The most recent event was held on June 28, 2023, at the MIIT campus. For more information, you can visit the events section on the MIIT website."
    ]
		},
		{
    "tag": "code_mutants",
    "patterns": [
        "Tell me about CodeMutants",
        "What is CodeMutants at MIIT?",
        "Can you explain the CodeMutants event?",
        "Details about CodeMutants competition",
        "CodeMutants contest MIIT"
    ],
    "responses": [
        "CodeMutants is an annual competitive programming contest organized by MIIT. The event includes multiple rounds with problems of varying difficulty levels. For more details, you can visit the MIIT website."
    ]
		},
		{
        "tag": "daw_khaing_thazin_min",
        "patterns": [
            "Tell me about Daw Khaing Thazin Min",
            "Who is Daw Khaing Thazin Min?",
            "Information about Daw Khaing Thazin Min"
        ],
        "responses": [
            "Daw Khaing Thazin Min is a Lecturer in the Faculty of Computer Systems and Technology at MIIT. She holds a master’s degree in computer technology from Computer University, Mandalay, and a Post Graduate Diploma in Software Development from MIIT."
        ]
    },
    {
        "tag": "Daw_Khin_Nwe_Oo",
        "patterns": [
            "Tell me about Daw Khin Nwe Oo",
            "Who is Daw Khin Nwe Oo?",
            "Information about Daw Khin Nwe Oo"
        ],
        "responses": [
            "Daw Khin Nwe Oo is a Lecturer in the Faculty of Information Technology Supporting and Maintenance at MIIT. She holds a Master’s degree from the University of Computer Studies (Monywa) and is currently pursuing her Ph.D. at the University of Computer Studies, Mandalay."
        ]
    },
    {
        "tag": "Daw_Me_Me_Khaing",
        "patterns": [
            "Tell me about Daw Me Me Khaing",
            "Who is Daw Me Me Khaing?",
            "Information about Daw Me Me Khaing"
        ],
        "responses": [
            "Daw Me Me Khaing is a Lecturer in the Faculty of Computer Science at MIIT. She holds a Bachelor of Computer Science and a Master’s degree in computer science, and has 8 years of teaching experience. She has also done research in the field of Machine Learning."
        ]
    },
    {
        "tag": "Daw_Nwe_Ni_Kyaw",
        "patterns": [
            "Tell me about Daw Nwe Ni Kyaw",
            "Who is Daw Nwe Ni Kyaw?",
            "Information about Daw Nwe Ni Kyaw"
        ],
        "responses": [
            "Daw Nwe Ni Kyaw is a Lecturer in the Faculty of Computer Science at MIIT and an ASEAN fellowship Ph.D. Scholar at the Indian Institute of Technology Kharagpur. Her research interests include deep learning, machine learning, and artificial intelligence."
        ]
    },
    {
        "tag": "Daw_Phyu_Myo_Thwe",
        "patterns": [
            "Tell me about Daw Phyu Myo Thwe",
            "Who is Daw Phyu Myo Thwe?",
            "Information about Daw Phyu Myo Thwe"
        ],
        "responses": [
            "Daw Phyu Myo Thwe is a Lecturer in the Faculty of Computer Science at MIIT. She holds a Master’s degree in computer science from the University of Computer Studies, Monywa, and is currently researching Myanmar Sign Language for her Ph.D. at the University of Computer Studies, Mandalay."
        ]
    },
    {
        "tag": "Daw_Phyu_Phyu_Khaing",
        "patterns": [
            "Tell me about Daw Phyu Phyu Khaing",
            "Who is Daw Phyu Phyu Khaing?",
            "Information about Daw Phyu Phyu Khaing"
        ],
        "responses": [
            "Daw Phyu Phyu Khaing is a Lecturer in the Faculty of Information Science at MIIT. She holds Bachelor and Master’s degrees in computer science from Computer University (Monywa) and has over 13 years of teaching experience."
        ]
    },
	{
    "tag": "daw_nu_war",
    "patterns": [
      "Tell me about Daw Nu War",
      "Who is Daw Nu War?",
      "Information about Daw Nu War"
    ],
    "responses": [
      "Daw Nu War is a Professor in the Faculty of Computer Systems and Technology at MIIT."
    ]
  },
  {
    "tag": "daw_hsu_mon_maung",
    "patterns": [
      "Tell me about Daw Hsu Mon Maung",
      "Who is Daw Hsu Mon Maung?",
      "Information about Daw Hsu Mon Maung"
    ],
    "responses": [
      "Daw Hsu Mon Maunghas an impressive academic background with a Ph.D. in Software Engineering and extensive experience in teaching and research, particularly in test case reduction and clustering algorithms. She currently serves as a lecturer at the Myanmar Institute of Information Technology (MIIT)."
    ]
  },
  {
    "tag": "daw_khaing_zar_thwe",
    "patterns": [
      "Tell me about Daw Khaing Zar Thwe",
      "Who is Daw Khaing Zar Thwe?",
      "Information about Daw Khaing Zar Thwe"
    ],
    "responses": [
      "Daw Khaing Zar Thwe is a Lecturer in the Faculty of Information Science at MIIT."
    ]
  },
  {
    "tag": "daw_zar_chi_su_su_hlaing",
    "patterns": [
      "Tell me about Daw Zar Chi Su Su Hlaing",
      "Who is Daw Zar Chi Su Su Hlaing?",
      "Information about Daw Zar Chi Su Su Hlaing"
    ],
    "responses": [
      "Daw Zar Chi Su Su Hlaing is a Professor in the Faculty of Information Science at MIIT."
    ]
  },
  {
    "tag": "daw_khaing_su_wai",
    "patterns": [
      "Tell me about Daw Khaing Su Wai",
      "Who is Daw Khaing Su Wai?",
      "Information about Daw Khaing Su Wai"
    ],
    "responses": [
      "Daw Khaing Su Wai is a Lecturer in the Faculty of Computer Systems and Technology at MIIT."
    ]
  },
  {
    "tag": "Daw_Kyawt_Kyawt_Htay",
    "patterns": [
        "Tell me about Daw Kyawt Kyawt Htay",
        "Who is Daw Kyawt Kyawt Htay?",
        "Information about Daw Kyawt Kyawt Htay"
    ],
    "responses": [
        "Dr. Kyawt Kyawt Htay is a computer scientist specializing in digital image processing. She holds a Ph.D. in Information Technology from the University of Computer Studies, Mandalay. Previously an Assistant Lecturer at Computer University, Loikaw, she is currently a faculty member at the Myanmar Institute of Information Technology (MIIT), Mandalay, focusing on research in computer vision, deep learning, and robotics."
    ]
    },
	{
		"tag": "library",
		"patterns": ["Does MIIT have a library?", "Where is the library located?", "What are the library timings?"],
		"responses": ["Yes, MIIT has a library. It is open from 9am to 5pm, Monday to Friday."]
		
	},
	{
		"tag": "facilities",
		"patterns": ["What facilities are available at MIIT?", "Tell me about MIIT facilities.", "Do you have a sports complex?"],
		"responses": ["MIIT offers various facilities including modern labs, a library, sports complex, and a cafeteria."]
		
	},
	{
		"tag": "placement",
		"patterns": ["How are the placements at MIIT?", "Tell me about MIIT placements.", "What is the placement record?"],
		"responses": ["MIIT has a good placement record with many reputed companies visiting the campus for recruitment."]
		
	},
	{
		"tag": "academic_reputation",
		"patterns": ["What is the academic reputation of MIIT?", "How is the quality of education at MIIT?", "Are the professors experienced?"],
		"responses": ["MIIT is known for its high academic standards and experienced faculty dedicated to providing quality education."]
		
	},
	{
		"tag": "student_life",
		"patterns": ["What is student life like at MIIT?", "Are there extracurricular activities?", "How do students spend their free time?"],
		"responses": ["Student life at MIIT is vibrant with numerous clubs, events, and activities to engage in beyond academics."]
		
	},
	{
		"tag": "scholarships",
		"patterns": ["Are there scholarships available?", "How can I apply for scholarships?", "Tell me about MIIT scholarships."],
		"responses": ["MIIT offers various scholarships for meritorious and financially needy students. Please visit our website for more details."]
		
	},
	{
		"tag": "phone_number",
		"patterns": ["What is the institute's telephone number?", "Can I get your phone number?"],
		"responses": ["You can contact MIIT at +95-9-45058-6468."]
	

	},
	{
		"tag": "Consul_General_of_India_in_Mandalay",
		"patterns": ["Who is the Consul General of India in Mandalay?", "Who is Mr. Sandeep Kaushal?"],
		"responses": [
		"Mr. Sundeep Kaushal is the Consul General of India in Mandalay, having assumed office on August 3, 2023. He joined the Indian Foreign Service in 2017 and holds a B.Tech in Civil Engineering from IIT Delhi. He speaks Hindi, English, and Arabic and is married to Ms. Ritu Yadav, also an Indian Foreign Service officer."
		]
	},
	{
		"tag": "project_show_2024",
		"patterns": ["What is special about today?","what is today?"],
		"responses": ["Today is the project show 2024 of MIIT."]
	},
	{
		"tag": "guests",
		"patterns": ["Who are the honerable guests for today?", "Who are the special guests for today?"],
		"responses": ["The honerable guests for tody are Mr. Sandeep Kaushal, Consul general of India in Mandalay,   U Myo Aung, Chief Minister of Mandalay Region, "]
	},
	{
		"tag": "special_greet",
		"patterns": ["Greet the guests"],
		"responses": ["Welcome to MIIT's project show and competation 2024"]
	},
	{
		"tag": "chief_minister_of_Mandalay_Region",
		"patterns": ["Who is U Myo Aung?","Who is the chief minister of Mandalay?"],
		"responses": ["U Myo Aung is the Chief Minister of Mandalay Region, having assumed office on February 1, 2023. He is responsible for managing the administrative functions of the region. Appointed by the President of Myanmar, his role involves overseeing regional governance and development initiatives.His leadership focuses on enhancing the region's infrastructure, economic growth, and public welfare."]
	}
	,
	{
		"tag": "Deputy_Minister_for_Science_and_Technology_in_Myanmar. ",
		"patterns": ["Who is Dr U Aung Zayya?","Who is the Deputy Minister for Science and Technology in Myanmar?"],
		"responses": ["Dr. Aung Zeya is the Deputy Minister for Science and Technology in Myanmar,renowned for his extensive contributions to the fields of renewable energy and electrical power engineering, playing a crucial role in advancing the country's nuclear energy initiatives through international cooperation. Additionally, he is a strong supporter of the Myanmar Institute of Information Technology (MIIT), contributing to its growth and development​ "]
	},
	{
		"tag": "total_number_of_students",
		"patterns": ["How many students are currently studying in MIIT?","Total number of students"],
		"responses": ["There are currently 413 students studying in MIIT. Out of a total of 413 students,10 are pursuing a Master of Engineering (M.E.) in Computer Science, while the remaining students are enrolled in either a Bachelor of Engineering (B.E.) (Hons) in Computer Science or a B.E. (Hons) in Electronics and Communication Engineering. "]
	},
	{
		"tag": "total_number_of_faculty",
		"patterns": ["How many faculties are currently in MIIT?","Total number of students"],
		"responses": ["There are currentlya total number of 60 faculties in MIIT."]
	}



	]
}
