{
	"intents": [
		{
			"tag": "greeting",
			"patterns": [
				"Hi",
				"Hello",
				"Good morning",
				"Good afternoon",
				"Hey",
				"မင်္ဂလာပါ",
				"မင်္ဂလာနံနက်ခင်းပါ",
				"မင်္ဂလာနေ့လည်ခင်းပါ",
				"ဟေး"
			],
			"responses": [
				"မင်္ဂလာပါ ၊ ဘာများ အကူအညီလိုပါသလဲခင်ဗျ။"
			]
		},
		{
			"tag": "farewell",
			"patterns": [
				"ဘိုင်",
				"နောက်မှတွေ့မယ်",
				"သွားတော့မယ်",
				"Bye",
				"See you later",
				"Goodbye",
				"Talk to you later"
			],
			"responses": [
				"ဟုတ်ကဲ့ ၊ ကောင်းသောနေ့လေးဖြစ်ပါစေ!"
			]
		},
		{
			"tag": "Myanmar_Engineering_Society",
			"patterns": [
				"Myanmar Engineering Society",
				"မြန်မာနိုင်ငံအင်ဂျင်နီယာအသင်း",
				"MES"
			],
			"responses": [
				"မြန်မာနိုင်ငံအင်ဂျင်နီယာအသင်း (Myanmar Engineering Society) သည် ၂၃ ဒီဇင်ဘာ ၁၉၉၅ ခုနှစ်တွင် စတင်ဖွဲ့စည်းခဲ့သော ပညာရပ်ဆိုင်ရာ ဖွံဖြိုးရေးကို ဦးတည်ဆောင်ရွက်လျက်ရှိသည့် အသင်းကြီးဖြစ်သည်။ အသင်းတွင် ဌာနဆိုင်ရာအင်ဂျင်နီယာများ၊ နည်းပညာတက္ကသိုလ်များမှ ဆရာဆရာမများနှင့် ကျောင်းသားကျောင်းသူများ၊ ပြင်ပပုဂ္ဂလိက အင်ဂျင်နီယာများဖြင့် ဖွဲ့စည်းထားခြင်းဖြစ်သည်။"
			]
		},
		{
			"tag": "History_of_Myanmar_Engineering_Society",
			"patterns": [
				"History of Myanmar Engineering Society",
				"မြန်မာနိုင်ငံအင်ဂျင်နီယာအသင်းသမိုင်းကြောင်း",
				"History of MES"
			],
			"responses": [
				"၁၉၁၆ ခုနှစ်တွင် The Burma Engineering Congress အဖြစ် စတင်ဖွဲ့စည်းခဲ့သည်။ ၁၉၂၇ ခုနှစ်တွင် The Association of Engineers in Burma ဟု အမည်ပြောင်းလဲခဲ့သည်။ ဒုတိယကမ္ဘာစစ်ဖြစ်ပွားသောကြောင့် ၁၉၃၉ ခုနှစ်မှ ၁၉၄၅ ခုနှစ်အထိ အသင်းလှုပ်ရှားမှုများ ရပ်နားခဲ့ရသည်။ ၁၉၄၆ ခုနှစ်မှစ၍ အသင်းလှုပ်ရှားမှုများ ပြန်လည်စတင်ခဲ့သည်။ သို့သော် အစိုးရအဖွဲ့၏ ပါတီနှင့် အဖွဲ့အစည်းများ ဖျက်သိမ်းသည့် ဥပဒေကြောင့် ၁၉၆၃ ခုနှစ်တွင် အသင်းကို ဖျက်သိမ်းခဲ့သည်။၁၉၉၅ ခုနှစ် ဒီဇင်ဘာလ ၂၃ ရက်နေ့တွင် The Association of Engineers in Burma အား မြန်မာနိုင်ငံအင်ဂျင်နီယာအသင်း အဖြစ် ရန်ကုန်နည်းပညာတက္ကသိုလ် အစည်းအဝေးခန်းမတွင် ပြန်လည်ဖွဲ့စည်းခဲ့သည်။"
			]
		},
		{
			"tag": "Members",
			"patterns": [
				"Numbers of members of Myanmar Engineering Society",
				"မြန်မာနိုင်ငံအင်ဂျင်နီယာအသင်းဝင်",
				"မြန်မာနိုင်ငံအင်ဂျင်နီယာအသင်းဝင်မည်မျှရှိသနည်း",
				"အသင်းဝင်မည်မျှရှိသနည်း",
				"MES members"
			],
			"responses": [
				"အသင်းဝင်ပေါင်း ၂၂၅၆၂ ဦး ရှိထားပြီး ဗဟိုကော်မတီ တချို့မှာလည်း ဌာနဆိုင်ရာမှ တိုက်ရိုက်ခန့်ထားခြင်း ဖြစ်သည်။"
			]
		},
		{
			"tag": "စက်မှု ဝန်ကြီးဌာန",
			"patterns": [
				"စက်မှု ဝန်ကြီးဌာန"
			],
			"responses": [
				"မြန်မာနိုင်ငံ လွတ်လပ်ရေးရရှိပြီးအချိန်တွင် စက်မှုလက်မှုလုပ်ငန်းများနှင့် ပတ်သက်၍ ဝန်ကြီးဌာနတစ်ခုအနေဖြင့် သီးခြားဖွဲ့စည်း ထားခြင်းမရှိဘဲ စက်မှုလက်မှုနှင့် ကူးသန်းရောင်းဝယ်ရေး ဝန်ကြီးဌာန၊ စက်မှုလက်မှုနှင့်အလုပ်သမားဝန်ကြီးဌာန၊ စက်မှုလက်မှုနှင့် သတ္တုတွင်းဝန်ကြီးဌာနဟူ၍ အဆင့်ဆင့်ပြောင်းလဲ ဖွဲ့စည်းခဲ့ပြီး ၁၉၅၂ ခုနှစ်တွင် စက်မှုလက်မှုဝန်ကြီးဌာန အဖြစ်ဖွဲ့စည်းခဲ့သည်။"
			]
		}
	]
}