{
	"intents": [
		{
			"tag": "greeting",
			"patterns": [
				"Hi",
				"Hello",
				"Good morning",
				"Good afternoon",
				"Hey",
				"မင်္ဂလာပါ",
				"မင်္ဂလာနံနက်ခင်းပါ",
				"မင်္ဂလာနေ့လည်ခင်းပါ",
				"ဟေး"
			],
			"responses": [
				"မင်္ဂလာပါ ၊ ဘာများ အကူအညီလိုပါသလဲခင်ဗျ။"
			]
		},
		{
			"tag": "farewell",
			"patterns": [
				"ဘိုင်",
				"နောက်မှတွေ့မယ်",
				"သွားတော့မယ်",
				"Bye",
				"See you later",
				"Goodbye",
				"Talk to you later"
			],
			"responses": [
				"ဟုတ်ကဲ့ ၊ ကောင်းသောနေ့လေးဖြစ်ပါစေ!"
			]
		},
		{
            "tag": "Engineering",
            "patterns": [
                "Engineering",
				"Engineer",
				"အင်ဂျင်နီယာ",
				"အင်ဂျင်နီယာအတတ်ပညာ",
				"စက်မှုအတတ်ပညာ"
            ],
            "responses": [
                "စက်မှုအတတ်ပညာ (engineer) ဆိုသည်မှာ စက်မှုအတတ်နည်းပညာ (engineering) တစ်ခုခုဖြင့် အသက်မွေးဝမ်းကြောင်းပြုသူကို ဆိုသည်။ စက်မှုအတတ်ပညာရှင်များသည် သင်္ချာ နှင့် သိပ္ပံ အသိပညာ များကိုသုံး၍ နည်းပညာ အခက်အခဲများကို ကျော်လွှားကာ ကုန်ကျစရိတ် သက်သာပြီး အန္တရာယ် ကင်းသော ဖြေရှင်းချက်များကို ဖော်ထွင်းကာ လက်တွေ့ ပြဿနာများကို ဖော်ထွင်းသည်။ ထို့ကြောင့် စက်မှုအတတ်ပညာရှင်များ၏ အလုပ်သည် လူ့အဖွဲအစည်း နှင့် စီးပွားဖြစ် ထုတ်ကုန်လုပ်ငန်းတို့ကို ဆက်စပ်ပေးသူဖြစ်သည်။ အချို့သူများသည် စက်မှုအတတ်ပညာရှင်ကို အနုပညာနှင့် သင်္ချာပညာကို ပေါင်းစပ်ပေးသူဟုလည်း မြင်ကြသည်။"
            ]
        },
		{
            "tag": "Myanmar_Engineering_Society",
            "patterns": [
                "Myanmar Engineering Society",
				"Federation of Myanmar Engineering Societies",
				"မြန်မာနိုင်ငံအင်ဂျင်နီယာအသင်း",
				"မြန်မာနိုင်ငံ အင်ဂျင်နီယာအသင်းချုပ်",
                "အင်ဂျင်နီယာအသင်း",
				"Fed MES",
				"MES"
            ],
            "responses": [
                "မြန်မာနိုင်ငံအင်ဂျင်နီယာအသင်း (Myanmar Engineering Society) သည် ၂၃ ဒီဇင်ဘာ ၁၉၉၅ ခုနှစ်တွင် စတင်ဖွဲ့စည်းခဲ့သော ပညာရပ်ဆိုင်ရာ ဖွံဖြိုးရေးကို ဦးတည်ဆောင်ရွက်လျက်ရှိသည့် အသင်းကြီးဖြစ်သည်။ အသင်းတွင် ဌာနဆိုင်ရာအင်ဂျင်နီယာများ၊ နည်းပညာတက္ကသိုလ်များမှ ဆရာဆရာမများနှင့် ကျောင်းသားကျောင်းသူများ၊ ပြင်ပပုဂ္ဂလိက အင်ဂျင်နီယာများဖြင့် ဖွဲ့စည်းထားခြင်းဖြစ်သည်။\n\n (အသင်း၏ ဝက်ဘ်ဆိုက် : http://www.mes.org.mm/)"
            ]
        },
		{
			"tag": "History_of_Myanmar_Engineering_Society",
			"patterns": [
				"History_of_Myanmar_Engineering_Society",
				"History of Myanmar Engineering Society",
				"မြန်မာနိုင်ငံအင်ဂျင်နီယာအသင်းသမိုင်းကြောင်း",
                "သမိုင်းကြောင်း",
				"History of MES"
			],
			"responses": [
				"၁၉၁၆ ခုနှစ်တွင် The Burma Engineering Congress အဖြစ် စတင်ဖွဲ့စည်းခဲ့သည်။ ၁၉၂၇ ခုနှစ်တွင် The Association of Engineers in Burma ဟု အမည်ပြောင်းလဲခဲ့သည်။ ဒုတိယကမ္ဘာစစ်ဖြစ်ပွားသောကြောင့် ၁၉၃၉ ခုနှစ်မှ ၁၉၄၅ ခုနှစ်အထိ အသင်းလှုပ်ရှားမှုများ ရပ်နားခဲ့ရသည်။ ၁၉၄၆ ခုနှစ်မှစ၍ အသင်းလှုပ်ရှားမှုများ ပြန်လည်စတင်ခဲ့သည်။ သို့သော် အစိုးရအဖွဲ့၏ ပါတီနှင့် အဖွဲ့အစည်းများ ဖျက်သိမ်းသည့် ဥပဒေကြောင့် ၁၉၆၃ ခုနှစ်တွင် အသင်းကို ဖျက်သိမ်းခဲ့သည်။၁၉၉၅ ခုနှစ် ဒီဇင်ဘာလ ၂၃ ရက်နေ့တွင် The Association of Engineers in Burma အား မြန်မာနိုင်ငံအင်ဂျင်နီယာအသင်း အဖြစ် ရန်ကုန်နည်းပညာတက္ကသိုလ် အစည်းအဝေးခန်းမတွင် ပြန်လည်ဖွဲ့စည်းခဲ့သည်။"
			]
		},
		{
			"tag": "Members",
			"patterns": [
				"Numbers of members of Myanmar Engineering Society",
				"မြန်မာနိုင်ငံအင်ဂျင်နီယာအသင်းဝင်",
				"မြန်မာနိုင်ငံအင်ဂျင်နီယာအသင်းဝင်မည်မျှရှိသနည်း",
				"အသင်းဝင်မည်မျှရှိသနည်း",
				"MES members"
			],
			"responses": [
				"အသင်းဝင်ပေါင်း ၂၂၅၆၂ ဦး ရှိထားပြီး ဗဟိုကော်မတီ တချို့မှာလည်း ဌာနဆိုင်ရာမှ တိုက်ရိုက်ခန့်ထားခြင်း ဖြစ်သည်။"
			]
		},
		{
            "tag": "Myanmar_Computer_Scientists_Association",
            "patterns": [
                "Myanmar Computer Scientists Association",
				"Myanmar Computer Professionals Association",
				"မြန်မာနိုင်ငံ ကွန်ပျူတာပညာရှင်အသင်း",
                "ကွန်ပျူတာပညာရှင်အသင်း",
				"MCSA",
				"MCPA"
            ],
            "responses": [
                "မြန်မာနိုင်ငံကွန်ပျူတာပညာရှင်အသင်းကို ၁၉၉၈ခုနှစ် မေလ ၁၇ရက်တွင် စတင်ဖွဲ့စည်းခဲ့သည်။ စတင်ဖွဲ့စည်းချိန်မှ ၂၀၀၄ခုနှစ်အထိ Myanmar Computer Scientists Association (MCSA) ဟုခေါ်ဆိုခဲ့ပြီး ယခုအခါ Myanmar Computer Professionals Association (MCPA) ဟု ပြောင်းလဲခေါ်ဝေါ်လျက်ရှိသည်။\n\n (အသင်း၏ ဝက်ဘ်ဆိုက် : https://www.mcpamyanmar.org/)"
            ]
        },
		{
            "tag": "Chairmen_of_Myanmar_Computer_Scientists_Association",
            "patterns": [
                "Chairman of Myanmar Computer Scientists Association",
				"ဥက္ကဋ္ဌများမြန်မာနိုင်ငံကွန်ပျူတာပညာရှင်အသင်း",
				"မြန်မာနိုင်ငံကွန်ပျူတာပညာရှင်အသင်းဥက္ကဋ္ဌများ",
                "ကွန်ပျူတာပညာရှင်အသင်း ဥက္ကဋ္ဌများ",
				"Chairmen"
            ],
            "responses": [
                "မြန်မာနိုင်ငံကွန်ပျူတာပညာရှင်အသင်းဥက္ကဋ္ဌများ\n\nဦးသိန်းဦး (၁၉၉၈-၂၀၀၁)\n\nဦးသောင်းတင် (၂၀၀၂-၂၀၀၅)\n\nဦးခွန်ဦး (၂၀၀၆ - ၂၀၁၀)\n\nဦးရဲရင့်ဝင်း (၂၀၁၁ မှ ယနေ့အထိ )"
            ]
        },
		{
            "tag": "Myanmar_Computer_Industry_Association",
            "patterns": [
                "Myanmar Computer Industry Association",
				"မြန်မာနိုင်ငံ ကွန်ပျူတာလုပ်ငန်းရှင်အသင်း",
                "ကွန်ပျူတာလုပ်ငန်းရှင်အသင်း",
				"MCIA"
            ],
            "responses": [
                "မြန်မာနိုင်ငံ ကွန်ပျူတာ လုပ်ငန်းရှင်အသင်း (MCIA) ကို ၁၉၉၈ ခုနှစ် မေလ ၁၇ ရက်နေ့တွင် စတင်ဖွဲ့စည်းခဲ့ပြီး ကွန်ပျူတာလုပ်ငန်းရှင်များ၏ လုပ်ငန်းများဖွံ့ဖြိုးတိုးတက်ရေးအတွက် စည်းရုံးဆောင်ရွက်နေသော အစိုးရမဟုတ်သည့် အဖွဲ့အစည်းဖြစ်သည်။ ကွန်ပျူတာလုပ်ငန်းရှင်အသင်းဝင်ပေါင်း ၂၉၁ ဦးရှိသည်။\n\n (အသင်း၏ ဝက်ဘ်ဆိုက် : https://mcia.org.mm/)"
            ]
        },
		{
            "tag": "objectives_and_mission_of_Myanmar_Computer_Industry_Association",
            "patterns": [
                "Objectives of Myanmar Computer Industry Association",
				"Missions of Myanmar Computer Industry Association",
				"မြန်မာနိုင်ငံ ကွန်ပျူတာလုပ်ငန်းရှင်အသင်းရည်ရွယ်ချက်",
                "ကွန်ပျူတာလုပ်ငန်းရှင်အသင်းရည်ရွယ်ချက်",
				"အသင်း၏ ရည်ရွယ်ချက်"
            ],
            "responses": [
                "အသင်း၏ ရည်ရွယ်ချက်များမှာ မြန်မာနိုင်ငံအတွင်းရှိ ပြည်နယ်၊ တိုင်း ကွန်ပျူတာလုပ်ငန်းရှင် အသင်းဝင်များကို စုစည်းနိုင်ရန်နှင့် စည်းရုံးဆောင်ရွက်ရန်၊ ကွန်ပျူတာပညာ ဖွံ့ဖြိုးရေးဥပဒေပါ ရည်ရွယ်ချက်များနှင့် အညီ အကောင်အထည်ဖော် ဆောင်ရွက်ရန်၊ နှင့် ကွန်ပျူတာလုပ်ငန်းရှင်များ၏ လုပ်ငန်းများ ပိုမိုဖွံ့ဖြိုးတိုးတက်ရန်အတွက် ပြည်တွင်း၊ ပြည်ပဆက်သွယ်ဆောင်ရွက်မှုများကို ဖွဲ့စည်းရန် တို့ ဖြစ်သည်။"
            ]
        },
		{
            "tag": "Duty_of_Myanmar_Computer_Industry_Association",
            "patterns": [
                "Duty of Myanmar Computer Industry Association",
				"မြန်မာနိုင်ငံ ကွန်ပျူတာလုပ်ငန်းရှင်အသင်း၏ လုပ်ငန်းများ",
                "ကွန်ပျူတာလုပ်ငန်းရှင်အသင်း၏ လုပ်ငန်းများ",
				"အသင်း၏ လုပ်ငန်းများ"
            ],
            "responses": [
                "နိုင်ငံတကာဆက်ဆံမှု တိုးမြှင့်ရေးဆပ်ကော်မတီ\n\nပြန်ကြားရေးနှင့် သတင်းဖြန့်ချိရေးဆပ်ကော်မတီ\n\nSeminar နှင့် Training ဆပ်ကော်မတီ\n\nIT လုပ်ငန်းကိစ္စရပ်များဖြေရှင်းရေးဆပ်ကော်မတီ\n\nICT Award ဆိုင်ရာ ပြုလုပ်ရေး ဆပ်ကော်မတီ\n\nIT နှင့် ပတ်သက်၍ ကုမ္ပဏီများအား အကူအညီပေးရေး ဆပ်ကော်မတီ\n\nဈေးနှုန်းစိစစ်ရေး ဆပ်ကော်မတီ\n\nဘဏ္ဍာရေး ဆပ်ကော်မတီစသည့် ကော်မတီခွဲများ ဖွဲ့စည်းကာ ဆောင်ရွက်လျက်ရှိပြီးအသင်းဝင်ကုမ္ပဏီများ၏ ICT နှင့်သက်ဆိုင်သော လုပ်ငန်းကိစ္စရပ်များကို ကူညီပေးခြင်းနှင့် အခြားအငြင်းပွားမှုများနှင့် ပြဿနာများကို ဖြေရှင်းညှိနှိုင်းပေးခြင်း ၊ Service Center များအား MICA အသိအမှတ်ပြုလက်မှတ်များ ထုတ်ပေးခြင်း၊ ICT ကုမ္ပဏီများက ပြည်ပမှ ကွန်ပျူတာနှင့် ဆက်စပ်ပစ္စည်းများတင်သွင်းရန် စီးပွားရေးနှင့်ကူးသန်းရောင်းဝယ်ရေးဝန်ကြီးဌာနသို့ လျှောက်ထားရာတွင် ဈေးနှုန်းသတ်မှတ်မှုလွယ်ကူစေရန် ဈေးနှုန်းများကို စိစစ်သတ်မှတ်ပေးခြင်းများ စသည်တို့ကို ဆောင်ရွက်ပေးလျက်ရှိသည်။"
            ]
        },
		{
            "tag": "Activities_of_Myanmar_Computer_Industry_Association",
            "patterns": [
                "Activities of Myanmar Computer Industry Association",
				"မြန်မာနိုင်ငံ ကွန်ပျူတာလုပ်ငန်းရှင်အသင်း၏ လှုပ်ရှားမှုများ",
                "ကွန်ပျူတာလုပ်ငန်းရှင်အသင်း၏ လှုပ်ရှားမှုများ",
				"အသင်း၏ လှုပ်ရှားမှုများ"
            ],
            "responses": [
                "ပြည်တွင်းပြည်ပမှ ကျွမ်းကျင်ပညာရှင်များကို ဖိတ်ခေါ်၍ seminar နှင့် workshop များကို လစဉ်ပြုလုပ်ပေးကာ အဖွဲ့ဝင်ကုမ္ပဏီများအား နည်းပညာ ဗဟုသုတများကို ရရှိစေခြင်း ။\n\nMyanmar Human Resource Co.,Ltd. နှင့် ပူးပေါင်း၍ ICT ဆိုင်ရာ လူ့စွမ်းအားအရင်းအမြစ် ဖွံ့ဖြိုးရေးသင်တန်းများကို ပို့ချလျက်ရှိခြင်း ။\n\nမြန်မာနိုင်ငံကွန်ပျူတာအသင်းချုပ် (MCF)၊ မြန်မာနိုင်ငံ ကွန်ပျူတာပညာရှင်အသင်း (MCPA) တို့နှင့် ပူးပေါင်း၍ မြန်မာသတင်းအချက်အလက်နှင့် ဆက်သွယ်ရေးနည်းပညာပြပွဲများကို တပ်မတော်ခန်းမတွင် ၅ ကြိမ်၊ မြန်မာကွန်ဗင်းရှင်းစင်တာတွင် ၁ ကြိမ်၊ Myanmar Info-Tech တွင် ၁ ကြိမ် စီစဉ်ကျင်းပခဲ့သည်။\n\n၂၀၀၀ ပြည့်နှစ်မှ စတင်၍ Myanmar National ICT Award ပြိုင်ပွဲများကို နှစ်စဉ်ကျင်းပခဲ့သည်။"
            ]
        }
	]
}